7767517
74 84
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 235 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=1 6=9408
ReLU             Relu_1                   1 1 235 153
Pooling          MaxPool_2                1 1 153 154 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 154 154_splitncnn_0 154_splitncnn_1
Convolution      Conv_3                   1 1 154_splitncnn_1 238 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_4                   1 1 238 157
Convolution      Conv_5                   1 1 157 241 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_6                    2 1 241 154_splitncnn_0 160 0=0
ReLU             Relu_7                   1 1 160 161
Split            splitncnn_1              1 2 161 161_splitncnn_0 161_splitncnn_1
Convolution      Conv_8                   1 1 161_splitncnn_1 244 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_9                   1 1 244 164
Convolution      Conv_10                  1 1 164 247 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_11                   2 1 247 161_splitncnn_0 167 0=0
ReLU             Relu_12                  1 1 167 168
Split            splitncnn_2              1 2 168 168_splitncnn_0 168_splitncnn_1
Convolution      Conv_13                  1 1 168_splitncnn_1 250 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_14                  1 1 250 171
Convolution      Conv_15                  1 1 171 253 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Convolution      Conv_16                  1 1 168_splitncnn_0 256 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_17                   2 1 253 256 176 0=0
ReLU             Relu_18                  1 1 176 177
Split            splitncnn_3              1 2 177 177_splitncnn_0 177_splitncnn_1
Convolution      Conv_19                  1 1 177_splitncnn_1 259 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_20                  1 1 259 180
Convolution      Conv_21                  1 1 180 262 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         Add_22                   2 1 262 177_splitncnn_0 183 0=0
ReLU             Relu_23                  1 1 183 184
Split            splitncnn_4              1 2 184 184_splitncnn_0 184_splitncnn_1
Convolution      Conv_24                  1 1 184_splitncnn_1 265 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_25                  1 1 265 187
Convolution      Conv_26                  1 1 187 268 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Convolution      Conv_27                  1 1 184_splitncnn_0 271 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_28                   2 1 268 271 192 0=0
ReLU             Relu_29                  1 1 192 193
Split            splitncnn_5              1 2 193 193_splitncnn_0 193_splitncnn_1
Convolution      Conv_30                  1 1 193_splitncnn_1 274 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_31                  1 1 274 196
Convolution      Conv_32                  1 1 196 277 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         Add_33                   2 1 277 193_splitncnn_0 199 0=0
ReLU             Relu_34                  1 1 199 200
Split            splitncnn_6              1 2 200 200_splitncnn_0 200_splitncnn_1
Convolution      Conv_35                  1 1 200_splitncnn_1 280 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             Relu_36                  1 1 280 203
Convolution      Conv_37                  1 1 203 283 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
Convolution      Conv_38                  1 1 200_splitncnn_0 286 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=131072
BinaryOp         Add_39                   2 1 283 286 208 0=0
ReLU             Relu_40                  1 1 208 209
Split            splitncnn_7              1 2 209 209_splitncnn_0 209_splitncnn_1
Convolution      Conv_41                  1 1 209_splitncnn_1 289 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_42                  1 1 289 212
Convolution      Conv_43                  1 1 212 292 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
BinaryOp         Add_44                   2 1 292 209_splitncnn_0 215 0=0
ReLU             Relu_45                  1 1 215 216
Deconvolution    ConvTranspose_46         1 1 216 217 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2097152
BatchNorm        BatchNormalization_47    1 1 217 218 0=256
ReLU             Relu_48                  1 1 218 219
Deconvolution    ConvTranspose_49         1 1 219 220 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1048576
BatchNorm        BatchNormalization_50    1 1 220 221 0=256
ReLU             Relu_51                  1 1 221 222
Deconvolution    ConvTranspose_52         1 1 222 223 0=256 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1048576
BatchNorm        BatchNormalization_53    1 1 223 224 0=256
ReLU             Relu_54                  1 1 224 225
Split            splitncnn_8              1 3 225 225_splitncnn_0 225_splitncnn_1 225_splitncnn_2
Convolution      Conv_55                  1 1 225_splitncnn_2 226 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_56                  1 1 226 227
Convolution      Conv_57                  1 1 227 output 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      Conv_58                  1 1 225_splitncnn_1 229 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_59                  1 1 229 230
Convolution      Conv_60                  1 1 230 231 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Convolution      Conv_61                  1 1 225_splitncnn_0 232 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_62                  1 1 232 233
Convolution      Conv_63                  1 1 233 234 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
